//Программа должна выводить текст.
//Текст должен начинаться с "Меня зовут Амиго".
//Текст должен заканчиваться на "металлический зад!".
//Текст должен состоять из 9 строк (пустые строки - это тоже строки).
//Выводимый текст должен соответствовать заданию.
package com.mycompany.mavenproject1;

/**
 *
 * @author Hanna_Ismahilova
 */
public class Zadanie3 {
    public static void main(String[] args) {
        
System.out.println("Меня зовут Амиго.");
System.out.println();
System.out.println( "Я согласен на зарплату $800/месяц в первый год.\n"
        + "Я согласен на зарплату $1500/месяц во второй год.\n"
        + "Я согласен на зарплату $2200/месяц в третий год.\n"
        + "Я согласен на зарплату $2700/месяц в четвертый год.\n"
        + "Я согласен на зарплату $3200/месяц в пятый год.");
System.out.println();
System.out.println("Поцелуй мой блестящий металлический зад!");

    }
}
